const bv = ["BV1sYeweZEWB", "BV1hw4m1Z7eM", "BV1Fx421y7te", "BV1Kz421f7JF"];
const totalList = [
	{
		"type": "mc",
		"ver": "1.19.2",
		"name": "Original",
		"bioList": [
			"悦灵", "美西螈", "蝙蝠", "蜜蜂", "烈焰人", "猫", "洞穴蜘蛛", "鸡", "鳕鱼", "牛",
			"苦力怕", "海豚", "驴", "溺尸", "远古守卫者", "末影人", "末影螨", "唤魔者", "狐狸", "青蛙",
			"恶魂", "发光鱿鱼", "山羊", "守卫者", "疣猪兽", "马", "尸壳", "羊驼", "岩浆怪", "哞菇",
			"骡", "豹猫", "熊猫", "鹦鹉", "幻翼", "猪", "猪灵", "猪灵蛮兵", "掠夺者", "北极熊",
			"河豚", "兔子", "劫掠兽", "鲑鱼", "绵羊", "潜影贝", "蠹虫", "骷髅", "骷髅马", "史莱姆",
			"蜘蛛", "鱿鱼", "流浪者", "炽足兽", "蝌蚪", "行商羊驼", "热带鱼", "海龟", "恼鬼", "村民",
			"卫道士", "流浪商人", "监守者", "女巫", "凋灵骷髅", "狼", "僵尸疣猪兽", "僵尸", "僵尸马", "僵尸村民",
			"僵尸猪灵", "末影龙", "凋灵", "闪电苦力怕", "铁傀儡", "雪傀儡", "玩家"
		],
		"deathList": [
			"摔死", "爆炸死亡", "弹射物击败", "玩家击败", "怪物击败",
			"红石装置死亡", "窒息死亡", "投掷物击败", "BOSS击败", "岩浆死亡",
			"欲火焚身", "被刻意的游戏设计杀死", "冻死", "饿死", "魔法攻击击败",
			"伤害药水击败", "剧毒药水击败", "在载具上窒息", "闪电击败", "附魔的武器击败",
			"载具攻击", "淹死", "围殴致死", "烟花击败", "火球烧死",
			"刺穿", "蜇死", "音波尖啸抹除", "龙息烤熟", "凋零",
			"戳死", "熔岩地板", "过度挤压", "甜浆果刺死", "掉落虚空",
			"脱水死亡", "落地过猛", "石笋刺穿", "钟乳石刺穿", "铁砧砸扁",
			"感受动能", "高处坠落", "指令杀死", "传送门陷阱", "吞噬死亡",
			"咬死", "毒发生亡", "毒刺", "傀儡击败"
		]
	},
	{
		"type": "mc",
		"ver": "1.21",
		"name": "Original",
		"bioList": [
			"悦灵", "美西螈", "蝙蝠", "蜜蜂", "烈焰人", "猫", "洞穴蜘蛛", "鸡", "鳕鱼", "牛",
			"苦力怕", "海豚", "驴", "溺尸", "远古守卫者", "末影人", "末影螨", "唤魔者", "狐狸", "青蛙",
			"恶魂", "发光鱿鱼", "山羊", "守卫者", "疣猪兽", "马", "尸壳", "羊驼", "岩浆怪", "哞菇",
			"骡", "豹猫", "熊猫", "鹦鹉", "幻翼", "猪", "猪灵", "猪灵蛮兵", "掠夺者", "北极熊",
			"河豚", "兔子", "劫掠兽", "鲑鱼", "绵羊", "潜影贝", "蠹虫", "骷髅", "骷髅马", "史莱姆",
			"蜘蛛", "鱿鱼", "流浪者", "炽足兽", "蝌蚪", "行商羊驼", "热带鱼", "海龟", "恼鬼", "村民",
			"卫道士", "流浪商人", "监守者", "女巫", "凋灵骷髅", "狼", "僵尸疣猪兽", "僵尸", "僵尸马", "僵尸村民",
			"僵尸猪灵", "末影龙", "凋灵", "闪电苦力怕", "铁傀儡", "雪傀儡", "骷髅军团", "旋风人", "犰狳", "嗅探兽",
			"骆驼", "玩家"
		],
		"deathList": [
			"摔死", "爆炸死亡", "弹射物击败", "玩家击败", "怪物击败",
			"红石装置死亡", "窒息死亡", "投掷物击败", "BOSS击败", "岩浆死亡",
			"欲火焚身", "被刻意的游戏设计杀死", "冻死", "饿死", "魔法攻击击败",
			"伤害药水击败", "剧毒药水击败", "在载具上窒息", "闪电击败", "附魔的武器击败",
			"载具攻击", "淹死", "围殴致死", "烟花击败", "火球烧死",
			"刺穿", "蜇死", "音波尖啸抹除", "龙息烤熟", "凋零",
			"戳死", "熔岩地板", "过度挤压", "甜浆果刺死", "掉落虚空",
			"脱水死亡", "落地过猛", "石笋刺穿", "钟乳石刺穿", "铁砧砸扁",
			"感受动能", "高处坠落", "指令杀死", "传送门陷阱", "吞噬死亡",
			"咬死", "毒发生亡", "毒刺", "傀儡击败"
		]
	},
	{
		"type": "mc",
		"ver": "1.16.5",
		"name": "Original",
		"bioList": [
			"玩家"
		],
		"deathList": [
			"摔死", "爆炸死亡", "弹射物击败", "玩家击败", "怪物击败",
			"红石装置死亡", "窒息死亡", "投掷物击败", "BOSS击败", "岩浆死亡",
			"欲火焚身", "被刻意的游戏设计杀死", "冻死", "饿死", "魔法攻击击败",
			"伤害药水击败", "剧毒药水击败", "在载具上窒息", "闪电击败", "附魔的武器击败",
			"载具攻击", "淹死", "围殴致死", "烟花击败", "火球烧死",
			"刺穿", "蜇死", "音波尖啸抹除", "龙息烤熟", "凋零",
			"戳死", "熔岩地板", "过度挤压", "甜浆果刺死", "掉落虚空",
			"脱水死亡", "落地过猛", "石笋刺穿", "钟乳石刺穿", "铁砧砸扁",
			"感受动能", "高处坠落", "指令杀死", "传送门陷阱", "吞噬死亡",
			"咬死", "毒发生亡", "毒刺", "傀儡击败"
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "更好的下界生物",
		"bioList": [
			"萤火虫", "氢水母", "娜迦", "蝠猪", "丛林骷髅", "髑"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "AdventureZ",
		"bioList": [
			"黑石傀儡", "小黑石傀儡", "猪灵兽", "梦魇马", "灵魂收割者", "凋零死灵法师", "凋零傀儡", "骷髅先锋", "唤灵者", "烈焰守卫者",
			"眼球", "虚空之影", "红色真菌", "棕色真菌", "兽人", "猛犸象", "虚空碎片", "末影之鲸", "鬣蜥", "紫水晶傀儡",
			"沙犀", "萨满", "鹿", "末影疣猪"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "更好的末地",
		"bioList": [
			"蜻蜓", "末地史莱姆", "末地鱼", "黯影行者", "箱水母", "蚕"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "生物群系改造",
		"bioList": [
			"发光鱼", "蘑菇商人", "染病蝙蝠", "鬼魂", "迅足者", "牛仔掠夺者", "萤火虫", "腐尸", "猫头鹰", "根灵",
			"飞蛾", "Helmit Crab"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "你将失去的生物群系",
		"bioList": [
			"僧帽水母", "南瓜守卫"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Bygone Nether",
		"bioList": [
			"猪灵囚犯", "猪灵猎人", "凋灵恼鬼", "诡异末影人", "凋零死士", "凋零蛮兵", "凋零骷髅骑士", "凋灵骷髅马"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Charm",
		"bioList": [
			"珊瑚鱿鱼", "哞花"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Deeper and Darker",
		"bioList": [
			"Sculk Centipede", "Sculk Leech", "Sculk Snapper", "Shattered", "Shriek Worm", "Stalker"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "葡园酒香",
		"bioList": [
			"骡", "流浪酿酒师"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "丰富的生态",
		"bioList": [
			"椰子蟹", "骆驼", "企鹅", "松鼠"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "伊甸星环",
		"bioList": [
			"盘翼"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Friendsandfoes",
		"bioList": [
			"铜傀儡", "怒目怪", "冰术师", "幻术师", "大胃怪", "哞花", "淘气鬼", "凝灰岩傀儡", "野火"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Frostiful",
		"bioList": [
			"Frostologer", "Chillager", "Biter", "Sparkle", "Spectre", "Specterpillar"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Goblintraders",
		"bioList": [
			"哥布林商人", "熔岩哥布林商人"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Goodall",
		"bioList": [
			"Rhino", "Dumbo Octopus", "Pelican", "Fennec Fox", "Kiwi", "Manatee", "Seal", "Deer", "Flamingo", "Songbird",
			"Toucan", "Tortoise", "River Turtle", "Owl", "Ant", "Grizzly Bear", "Guard"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Meadow",
		"bioList": [
			"白化牛", "水牛", "曲奇牛", "奶油牛", "奶牛", "深色牛", "花斑牛", "日落牛", "阴影牛", "羊毛牛",
			"棕熊", "斑点羊", "绒毛羊", "角羊", "墨水羊", "长鼻羊", "拼接羊", "岩石羊", "Warped Cow", "Alpine Chicken"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "自然主义",
		"bioList": [
			"蜗牛", "灰熊", "蝴蝶", "萤火虫", "蛇", "珊瑚蛇", "响尾蛇", "鹿", "冠蓝鸦", "主红雀",
			"金丝雀", "旅鸫", "毛毛虫", "犀牛", "狮子", "大象", "斑马", "长颈鹿", "Hippo", "Vulture",
			"Boar", "Dragonfly", "Catfish", "Alligator", "Bass", "Lizard", "Tortoise", "Duck"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "更好的下界岩浆海鱼",
		"bioList": [
			"熔岩河豚", "黑曜鱼", "灼热鳕鱼", "骷髅鱼", "凋零鱼", "烈焰鱼", "岩浆怪鱼", "萤石鱼", "魂吸鱼", "Fortress Grouper",
			"Eyeball Fish"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Oxidized",
		"bioList": [
			"铜傀儡"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Promenade",
		"bioList": [
			"鸭", "繁茂苦力怕", "沉溺者", "Burned", "Frostbitten", "Swampy", "Undead Miner", "Mummy", "Glacial Hunter", "Dead Beard",
			"Immortal"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "Takesapillage",
		"bioList": [
			"远弓手", "突击手", "重装军"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "蜜蜂领域",
		"bioList": [
			"蜂蜜史莱姆", "巨蜂", "蜂后"
		],
		"deathList": [
			
		]
	},
	{
		"type": "mod",
		"ver": "1.19.2",
		"name": "暮色森林",
		"bioList": [
			"雪怪首领", "武装巨人", "大角羊", "链锤哥布林", "野猪", "砷铅铁寄生虫", "砷铅铁守卫", "砷铅铁恶灵", "砷铅铁傀儡", "死灵书",
			"野鹿", "侏儒兔", "喷火甲虫", "巨人矿工", "树篱蜘蛛", "寄居蟹", "恶狼", "九头蛇", "冰晶", "国王蜘蛛",
			"幻影骑士", "狗头人", "巫妖", "哥布林骑士", "迷宫史莱姆", "米诺菇", "牛头人", "迷雾狼", "蚊群", "娜迦",
			"企鹅", "巨钳甲虫", "谜题羊", "渡鸦", "红帽哥布林", "红帽工兵", "骷髅德鲁伊", "黏液甲虫", "冰雪守卫", "冰雪女王",
			"松鼠", "冰精灵", "集群蜘蛛", "小鸟", "塔木蛀虫", "洞穴巨魔", "破碎冰精灵", "暮初恶魂", "寒冬狼", "幽灵",
			"雪怪", "Firefly", "Woodpecker"
		],
		"deathList": [
			
		]
	}
]
